Create a Pandas Series from the list [10, 20, 30, 40, 50]. Print the Series, its index, and data type. Then create a DataFrame with columns "Name", "Age", and "City" containing at least 4 rows of data

In [1]:
import pandas as pd

# Create a Pandas Series from a list
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

print("Pandas Series:")
print(series)
print("-" * 40)

# Print index
print("Index:", series.index)
# Print data type
print("Data type:", series.dtype)
print("-" * 40)

# Create a DataFrame with columns Name, Age, and City
data_dict = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 28, 35],
    'City': ['Berlin', 'Paris', 'Rome', 'Madrid']
}

df = pd.DataFrame(data_dict)

print("Pandas DataFrame:")
print(df)
print("-" * 40)

Pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64
----------------------------------------
Index: RangeIndex(start=0, stop=5, step=1)
Data type: int64
----------------------------------------
Pandas DataFrame:
      Name  Age    City
0    Alice   25  Berlin
1      Bob   30   Paris
2  Charlie   28    Rome
3    Diana   35  Madrid
----------------------------------------

Using any DataFrame, write code to print the number of rows and columns, column data types (.dtypes), and summary statistics (.describe()).

In [5]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': [25, 30, 28, 35, 22],
    'Salary': [50000, 60000, 55000, 70000, 48000],
    'City': ['Berlin', 'Paris', 'Rome', 'Madrid', 'Lisbon']
}

df = pd.DataFrame(data)

# Print number of rows and columns
print("Number of Rows and Columns:")
print(df.shape)
print(f"Rows: {df.shape[0]}, Columns: {df.shape[1]}")
print("-" * 50)

# Print column data types
print("Column Data Types:")
print(df.dtypes)
print("-" * 50)

# Print summary statistics
print("Summary Statistics:")
print(df.describe())
print("-" * 50)

Number of Rows and Columns:
(5, 4)
Rows: 5, Columns: 4
--------------------------------------------------
Column Data Types:
Name      object
Age        int64
Salary     int64
City      object
dtype: object
--------------------------------------------------
Summary Statistics:
             Age        Salary
count   5.000000      5.000000
mean   28.000000  56600.000000
std     4.949747   8820.430828
min    22.000000  48000.000000
25%    25.000000  50000.000000
50%    28.000000  55000.000000
75%    30.000000  60000.000000
max    35.000000  70000.000000
--------------------------------------------------

Create a DataFrame using the dictionary below:

data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

Print .columns, .index. Access a single column and one full row.

In [6]:
import pandas as pd

# Create the DataFrame
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

df = pd.DataFrame(data)

# Print columns and index
print("Columns:", df.columns)
print("Index:", df.index)
print("-" * 40)

# Access a single column (e.g., 'Price')
print("Single Column - 'Price':")
print(df['Price'])
print("-" * 40)

# Access one full row (e.g., row at index 1)
print("Full Row at index 1:")
print(df.loc[1])   # or df.iloc[1]
print("-" * 40)

Columns: Index(['Product', 'Price', 'Quantity'], dtype='object')
Index: RangeIndex(start=0, stop=4, step=1)
----------------------------------------
Single Column - 'Price':
0    10
1    50
2     5
3     7
Name: Price, dtype: int64
----------------------------------------
Full Row at index 1:
Product     Book
Price         50
Quantity      60
Name: 1, dtype: object
----------------------------------------

Using .loc[] and .iloc[], show the first row, the second column, and a 2×2 block    from the middle of your DataFrame.

In [7]:
import pandas as pd

# Create the DataFrame again
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)
print("-" * 50)

# First row using .loc[] and .iloc[]
print("First Row (.loc):")
print(df.loc[0])      # by label
print("-" * 30)

print("First Row (.iloc):")
print(df.iloc[0])     # by integer position
print("-" * 50)

# Second column using .loc[] and .iloc[]
print("Second Column (.loc):")
print(df.loc[:, 'Price'])   # select column by name
print("-" * 30)

print("Second Column (.iloc):")
print(df.iloc[:, 1])        # select column by position
print("-" * 50)

# 2×2 block from the middle using .loc[] and .iloc[]
# Middle rows = index 1 & 2, middle columns = 'Price' and 'Quantity'
print("2×2 Block (.loc):")
print(df.loc[1:2, ['Price', 'Quantity']])
print("-" * 30)

print("2×2 Block (.iloc):")
print(df.iloc[1:3, 1:3])   # rows 1–2, columns 1–2
print("-" * 50)

Original DataFrame:
   Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150
--------------------------------------------------
First Row (.loc):
Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object
------------------------------
First Row (.iloc):
Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object
--------------------------------------------------
Second Column (.loc):
0    10
1    50
2     5
3     7
Name: Price, dtype: int64
------------------------------
Second Column (.iloc):
0    10
1    50
2     5
3     7
Name: Price, dtype: int64
--------------------------------------------------
2×2 Block (.loc):
   Price  Quantity
1     50        60
2      5       200
------------------------------
2×2 Block (.iloc):
   Price  Quantity
1     50        60
2      5       200
--------------------------------------------------

Create a 4×3 DataFrame of student names and marks. Drop one column using .drop(), drop one row by index

In [8]:
import pandas as pd

# Create a 4×3 DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Math Marks': [85, 92, 78, 88],
    'Science Marks': [90, 84, 80, 95]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
print("-" * 50)

# Drop one column (e.g., 'Science Marks')
df_dropped_col = df.drop(columns=['Science Marks'])
print("After Dropping 'Science Marks' Column:")
print(df_dropped_col)
print("-" * 50)

# Drop one row (e.g., row with index 2)
df_dropped_row = df.drop(index=2)
print("After Dropping Row with Index 2:")
print(df_dropped_row)
print("-" * 50)

Original DataFrame:
      Name  Math Marks  Science Marks
0    Alice          85             90
1      Bob          92             84
2  Charlie          78             80
3    Diana          88             95
--------------------------------------------------
After Dropping 'Science Marks' Column:
      Name  Math Marks
0    Alice          85
1      Bob          92
2  Charlie          78
3    Diana          88
--------------------------------------------------
After Dropping Row with Index 2:
    Name  Math Marks  Science Marks
0  Alice          85             90
1    Bob          92             84
3  Diana          88             95
--------------------------------------------------

Create a DataFrame of employees with columns "Name", "Department", and "Salary". Sort it by "Salary" in ascending order and by "Name" in descending order.

In [10]:
import pandas as pd

# Create a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
    'Salary': [50000, 70000, 65000, 70000, 48000]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
print("-" * 50)

# Sort by Salary (ascending) and then by Name (descending)
sorted_df = df.sort_values(by=['Salary', 'Name'], ascending=[True, False])

print("Sorted DataFrame (by Salary ↑ and Name ↓):")
print(sorted_df)
print("-" * 50)

Original DataFrame:
      Name Department  Salary
0    Alice         HR   50000
1      Bob         IT   70000
2  Charlie    Finance   65000
3    Diana         IT   70000
4    Ethan         HR   48000
--------------------------------------------------
Sorted DataFrame (by Salary ↑ and Name ↓):
      Name Department  Salary
4    Ethan         HR   48000
0    Alice         HR   50000
2  Charlie    Finance   65000
3    Diana         IT   70000
1      Bob         IT   70000
--------------------------------------------------

Create a DataFrame of 8 students with columns "Name" and "Score". Filter and print students with Score > 60 and those with Score < 40

In [11]:
import pandas as pd

# Create a DataFrame of 8 students
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah'],
    'Score': [75, 35, 82, 58, 92, 40, 28, 65]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)
print("-" * 50)

# Filter students with Score > 60
high_scores = df.loc[df['Score'] > 60]
print("Students with Score > 60:")
print(high_scores)
print("-" * 50)

# Filter students with Score < 40
low_scores = df.loc[df['Score'] < 40]
print("Students with Score < 40:")
print(low_scores)
print("-" * 50)

Original DataFrame:
      Name  Score
0    Alice     75
1      Bob     35
2  Charlie     82
3    Diana     58
4    Ethan     92
5    Fiona     40
6   George     28
7   Hannah     65
--------------------------------------------------
Students with Score > 60:
      Name  Score
0    Alice     75
2  Charlie     82
4    Ethan     92
7   Hannah     65
--------------------------------------------------
Students with Score < 40:
     Name  Score
1     Bob     35
6  George     28
--------------------------------------------------